bases/WIM_FIn/projects/OpenAdditionalProcessingSettings/Расширения/VTB_Devops/DataProcessors/ВТБ_ПакетнаяВыгрузкаНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>ВТБ_ПакетнаяВыгрузкаНастроек</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bases/WIM_FIn/projects/OpenAdditionalProcessingSettings/Расширения/VTB_Devops/Enums/ВариантыПубликацииДополнительныхОтчетовИОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыПубликацииДополнительныхОтчетовИОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Используется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РежимОтладки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отключена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bases/WIM_FIn/projects/OpenAdditionalProcessingSettings/Расширения/VTB_Devops/DataProcessors/ВТБ_ПакетнаяВыгрузкаНастроек/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПутьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 

	Если ДиалогОткрытия.Выбрать() Тогда 
		Объект.Путь = ДиалогОткрытия.Каталог; 
	КонецЕсли;   
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНастройки(Команда)
	
	Выборка = ПолучитьВыборкуОбработок();
		
	Для каждого Обработка из Выборка Цикл
		АдресВременногоХранилища = "";
		НаименованиеОбработки = Строка(Обработка);
		Путь = Объект.Путь + "\PIF_" +ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(НаименованиеОбработки)+".txt"; 
		Попытка
			Текст = Новый ЗаписьТекста(Путь, КодировкаТекста.UTF8, Символы.ПС);
			Текст.Закрыть();
		Исключение
		КонецПопытки;
		ПоместитьФайл(АдресВременногоХранилища, Путь,,Ложь,УникальныйИдентификатор); // помещаем наш файл во временное хранилище (для его передачи на сервер)        
		
		Адрес = ВыгрузитьНастройкиНаСервере(АдресВременногоХранилища,Обработка.УникальныйИдентификатор()); //ВыгрузитьВXMLНаСервере(АдресВременногоХранилища);
      	ДвоичныеДанные_ = ПолучитьИзВременногоХранилища(Адрес);  // по адресу временного хранилища получаем двоичные данные
		ДвоичныеДанные_.Записать(Путь);	
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВыборкуОбработок()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст ="ВЫБРАТЬ
	|	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
	|ГДЕ
	|	НЕ ДополнительныеОтчетыИОбработки.ПометкаУдаления
	|	И ДополнительныеОтчетыИОбработки.Публикация = &Публикация
	|	И НЕ ДополнительныеОтчетыИОбработки.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Публикация",ПредопределенноеЗначение("Перечисление.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется"));
	РезультатЗапроса = Запрос.Выполнить();
	МассивОбработок = Новый Массив;
	Выборка = РезультатЗапроса.Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		МассивОбработок.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	Возврат МассивОбработок;
	
КонецФункции 


&НаСервере
Функция ВыгрузитьНастройкиНаСервере(АдресВременногоХранилища,Guid)
//	Сообщить(Guid);
	Возврат ВТБ_DevOps.ВыгрузитьНастройкиНаСервере(АдресВременногоХранилища,Guid)
КонецФункции
